Revit 2027 API
RebarSpliceTypeUtils.CreateRebarSpliceType Method
 Creates a Rebar Splice Type element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementType CreateRebarSpliceType(
	Document document,
	string typeName
)
Public Shared Function CreateRebarSpliceType (
	document As Document,
	typeName As String
) As ElementType
public:
static ElementType^ CreateRebarSpliceType(
	Document^ document,
	String^ typeName
)
static member CreateRebarSpliceType :
        document : Document *
        typeName : string -> ElementType
Parameters
document Document
 The document.
typeName String
 The Rebar Splice Type name.
Return Value
ElementType
 The Rebar Splice Type.
Exceptions
Exception | Condition
ArgumentException |  The given value for typeName cannot be an empty string. -or- The given value for typeName cannot include prohibited characters. -or- The given value for typeName is already in use by another Rebar Splice Type.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSpliceTypeUtils Class
Autodesk.Revit.DB.Structure Namespace